MikroElektronika/core_packages/PIC/XC8/def/PIC16F1574/mcu.h
// Register: PWM1TMRL
#define PWM1TMRL PWM1TMRL
extern volatile unsigned char           PWM1TMRL            __at(0xD99);
#ifndef _LIB_BUILD
asm("PWM1TMRL equ 0D99h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
    struct {
        unsigned PWM1TMRL0              :1;
        unsigned PWM1TMRL1              :1;
        unsigned PWM1TMRL2              :1;
        unsigned PWM1TMRL3              :1;
        unsigned PWM1TMRL4              :1;
        unsigned PWM1TMRL5              :1;
        unsigned PWM1TMRL6              :1;
        unsigned PWM1TMRL7              :1;
    };
    struct {
        unsigned PWM1TMRL               :8;
    };
} PWM1TMRLbits_t;
extern volatile PWM1TMRLbits_t PWM1TMRLbits __at(0xD99);
// bitfield macros
#define _PWM1TMRL_TMR_POSN                                  0x0
#define _PWM1TMRL_TMR_POSITION                              0x0
#define _PWM1TMRL_TMR_SIZE                                  0x8
#define _PWM1TMRL_TMR_LENGTH                                0x8
#define _PWM1TMRL_TMR_MASK                                  0xFF
#define _PWM1TMRL_PWM1TMRL0_POSN                            0x0
#define _PWM1TMRL_PWM1TMRL0_POSITION                        0x0
#define _PWM1TMRL_PWM1TMRL0_SIZE                            0x1
#define _PWM1TMRL_PWM1TMRL0_LENGTH                          0x1
#define _PWM1TMRL_PWM1TMRL0_MASK                            0x1
#define _PWM1TMRL_PWM1TMRL1_POSN                            0x1
#define _PWM1TMRL_PWM1TMRL1_POSITION                        0x1
#define _PWM1TMRL_PWM1TMRL1_SIZE                            0x1
#define _PWM1TMRL_PWM1TMRL1_LENGTH                          0x1
#define _PWM1TMRL_PWM1TMRL1_MASK                            0x2
#define _PWM1TMRL_PWM1TMRL2_POSN                            0x2
#define _PWM1TMRL_PWM1TMRL2_POSITION                        0x2
#define _PWM1TMRL_PWM1TMRL2_SIZE                            0x1
#define _PWM1TMRL_PWM1TMRL2_LENGTH                          0x1
#define _PWM1TMRL_PWM1TMRL2_MASK                            0x4
#define _PWM1TMRL_PWM1TMRL3_POSN                            0x3
#define _PWM1TMRL_PWM1TMRL3_POSITION                        0x3
#define _PWM1TMRL_PWM1TMRL3_SIZE                            0x1
#define _PWM1TMRL_PWM1TMRL3_LENGTH                          0x1
#define _PWM1TMRL_PWM1TMRL3_MASK                            0x8
#define _PWM1TMRL_PWM1TMRL4_POSN                            0x4
#define _PWM1TMRL_PWM1TMRL4_POSITION                        0x4
#define _PWM1TMRL_PWM1TMRL4_SIZE                            0x1
#define _PWM1TMRL_PWM1TMRL4_LENGTH                          0x1
#define _PWM1TMRL_PWM1TMRL4_MASK                            0x10
#define _PWM1TMRL_PWM1TMRL5_POSN                            0x5
#define _PWM1TMRL_PWM1TMRL5_POSITION                        0x5
#define _PWM1TMRL_PWM1TMRL5_SIZE                            0x1
#define _PWM1TMRL_PWM1TMRL5_LENGTH                          0x1
#define _PWM1TMRL_PWM1TMRL5_MASK                            0x20
#define _PWM1TMRL_PWM1TMRL6_POSN                            0x6
#define _PWM1TMRL_PWM1TMRL6_POSITION                        0x6
#define _PWM1TMRL_PWM1TMRL6_SIZE                            0x1
#define _PWM1TMRL_PWM1TMRL6_LENGTH                          0x1
#define _PWM1TMRL_PWM1TMRL6_MASK                            0x40
#define _PWM1TMRL_PWM1TMRL7_POSN                            0x7
#define _PWM1TMRL_PWM1TMRL7_POSITION                        0x7
#define _PWM1TMRL_PWM1TMRL7_SIZE                            0x1
#define _PWM1TMRL_PWM1TMRL7_LENGTH                          0x1
#define _PWM1TMRL_PWM1TMRL7_MASK                            0x80
#define _PWM1TMRL_PWM1TMRL_POSN                             0x0
#define _PWM1TMRL_PWM1TMRL_POSITION                         0x0
#define _PWM1TMRL_PWM1TMRL_SIZE                             0x8
#define _PWM1TMRL_PWM1TMRL_LENGTH                           0x8
#define _PWM1TMRL_PWM1TMRL_MASK                             0xFF

// Register: PWM1TMRH
#define PWM1TMRH PWM1TMRH
extern volatile unsigned char           PWM1TMRH            __at(0xD9A);
#ifndef _LIB_BUILD
asm("PWM1TMRH equ 0D9Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
    struct {
        unsigned PWM1TMRH0              :1;
        unsigned PWM1TMRH1              :1;
        unsigned PWM1TMRH2              :1;
        unsigned PWM1TMRH3              :1;
        unsigned PWM1TMRH4              :1;
        unsigned PWM1TMRH5              :1;
        unsigned PWM1TMRH6              :1;
        unsigned PWM1TMRH7              :1;
    };
    struct {
        unsigned PWM1TMRH               :8;
    };
} PWM1TMRHbits_t;
extern volatile PWM1TMRHbits_t PWM1TMRHbits __at(0xD9A);
// bitfield macros
#define _PWM1TMRH_TMR_POSN                                  0x0
#define _PWM1TMRH_TMR_POSITION                              0x0
#define _PWM1TMRH_TMR_SIZE                                  0x8
#define _PWM1TMRH_TMR_LENGTH                                0x8
#define _PWM1TMRH_TMR_MASK                                  0xFF
#define _PWM1TMRH_PWM1TMRH0_POSN                            0x0
#define _PWM1TMRH_PWM1TMRH0_POSITION                        0x0
#define _PWM1TMRH_PWM1TMRH0_SIZE                            0x1
#define _PWM1TMRH_PWM1TMRH0_LENGTH                          0x1
#define _PWM1TMRH_PWM1TMRH0_MASK                            0x1
#define _PWM1TMRH_PWM1TMRH1_POSN                            0x1
#define _PWM1TMRH_PWM1TMRH1_POSITION                        0x1
#define _PWM1TMRH_PWM1TMRH1_SIZE                            0x1
#define _PWM1TMRH_PWM1TMRH1_LENGTH                          0x1
#define _PWM1TMRH_PWM1TMRH1_MASK                            0x2
#define _PWM1TMRH_PWM1TMRH2_POSN                            0x2
#define _PWM1TMRH_PWM1TMRH2_POSITION                        0x2
#define _PWM1TMRH_PWM1TMRH2_SIZE                            0x1
#define _PWM1TMRH_PWM1TMRH2_LENGTH                          0x1
#define _PWM1TMRH_PWM1TMRH2_MASK                            0x4
#define _PWM1TMRH_PWM1TMRH3_POSN                            0x3
#define _PWM1TMRH_PWM1TMRH3_POSITION                        0x3
#define _PWM1TMRH_PWM1TMRH3_SIZE                            0x1
#define _PWM1TMRH_PWM1TMRH3_LENGTH                          0x1
#define _PWM1TMRH_PWM1TMRH3_MASK                            0x8
#define _PWM1TMRH_PWM1TMRH4_POSN                            0x4
#define _PWM1TMRH_PWM1TMRH4_POSITION                        0x4
#define _PWM1TMRH_PWM1TMRH4_SIZE                            0x1
#define _PWM1TMRH_PWM1TMRH4_LENGTH                          0x1
#define _PWM1TMRH_PWM1TMRH4_MASK                            0x10
#define _PWM1TMRH_PWM1TMRH5_POSN                            0x5
#define _PWM1TMRH_PWM1TMRH5_POSITION                        0x5
#define _PWM1TMRH_PWM1TMRH5_SIZE                            0x1
#define _PWM1TMRH_PWM1TMRH5_LENGTH                          0x1
#define _PWM1TMRH_PWM1TMRH5_MASK                            0x20
#define _PWM1TMRH_PWM1TMRH6_POSN                            0x6
#define _PWM1TMRH_PWM1TMRH6_POSITION                        0x6
#define _PWM1TMRH_PWM1TMRH6_SIZE                            0x1
#define _PWM1TMRH_PWM1TMRH6_LENGTH                          0x1
#define _PWM1TMRH_PWM1TMRH6_MASK                            0x40
#define _PWM1TMRH_PWM1TMRH7_POSN                            0x7
#define _PWM1TMRH_PWM1TMRH7_POSITION                        0x7
#define _PWM1TMRH_PWM1TMRH7_SIZE                            0x1
#define _PWM1TMRH_PWM1TMRH7_LENGTH                          0x1
#define _PWM1TMRH_PWM1TMRH7_MASK                            0x80
#define _PWM1TMRH_PWM1TMRH_POSN                             0x0
#define _PWM1TMRH_PWM1TMRH_POSITION                         0x0
#define _PWM1TMRH_PWM1TMRH_SIZE                             0x8
#define _PWM1TMRH_PWM1TMRH_LENGTH                           0x8
#define _PWM1TMRH_PWM1TMRH_MASK                             0xFF

// Register: PWM1CON
#define PWM1CON PWM1CON
extern volatile unsigned char           PWM1CON             __at(0xD9B);
#ifndef _LIB_BUILD
asm("PWM1CON equ 0D9Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned MODE                   :2;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned OE                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :2;
        unsigned PWM1MODE0              :1;
        unsigned PWM1MODE1              :1;
    };
    struct {
        unsigned                        :2;
        unsigned PWM1MODE               :2;
        unsigned PWM1POL                :1;
        unsigned PWM1OUT                :1;
        unsigned PWM1OE                 :1;
        unsigned PWM1EN                 :1;
    };
    struct {
        unsigned                        :2;
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
    };
} PWM1CONbits_t;
extern volatile PWM1CONbits_t PWM1CONbits __at(0xD9B);
// bitfield macros
#define _PWM1CON_MODE_POSN                                  0x2
#define _PWM1CON_MODE_POSITION                              0x2
#define _PWM1CON_MODE_SIZE                                  0x2
#define _PWM1CON_MODE_LENGTH                                0x2
#define _PWM1CON_MODE_MASK                                  0xC
#define _PWM1CON_POL_POSN                                   0x4
#define _PWM1CON_POL_POSITION                               0x4
#define _PWM1CON_POL_SIZE                                   0x1
#define _PWM1CON_POL_LENGTH                                 0x1
#define _PWM1CON_POL_MASK                                   0x10
#define _PWM1CON_OUT_POSN                                   0x5
#define _PWM1CON_OUT_POSITION                               0x5
#define _PWM1CON_OUT_SIZE                                   0x1
#define _PWM1CON_OUT_LENGTH                                 0x1
#define _PWM1CON_OUT_MASK                                   0x20
#define _PWM1CON_OE_POSN                                    0x6
#define _PWM1CON_OE_POSITION                                0x6
#define _PWM1CON_OE_SIZE                                    0x1
#define _PWM1CON_OE_LENGTH                                  0x1
#define _PWM1CON_OE_MASK                                    0x40
#define _PWM1CON_EN_POSN                                    0x7
#define _PWM1CON_EN_POSITION                                0x7
#define _PWM1CON_EN_SIZE                                    0x1
#define _PWM1CON_EN_LENGTH                                  0x1
#define _PWM1CON_EN_MASK                                    0x80
#define _PWM1CON_PWM1MODE0_POSN                             0x2
#define _PWM1CON_PWM1MODE0_POSITION                         0x2
#define _PWM1CON_PWM1MODE0_SIZE                             0x1
#define _PWM1CON_PWM1MODE0_LENGTH                           0x1
#define _PWM1CON_PWM1MODE0_MASK                             0x4
#define _PWM1CON_PWM1MODE1_POSN                             0x3
#define _PWM1CON_PWM1MODE1_POSITION                         0x3
#define _PWM1CON_PWM1MODE1_SIZE                             0x1
#define _PWM1CON_PWM1MODE1_LENGTH                           0x1
#define _PWM1CON_PWM1MODE1_MASK                             0x8
#define _PWM1CON_PWM1MODE_POSN                              0x2
#define _PWM1CON_PWM1MODE_POSITION                          0x2
#define _PWM1CON_PWM1MODE_SIZE                              0x2
#define _PWM1CON_PWM1MODE_LENGTH                            0x2
#define _PWM1CON_PWM1MODE_MASK                              0xC
#define _PWM1CON_PWM1POL_POSN                               0x4
#define _PWM1CON_PWM1POL_POSITION                           0x4
#define _PWM1CON_PWM1POL_SIZE                               0x1
#define _PWM1CON_PWM1POL_LENGTH                             0x1
#define _PWM1CON_PWM1POL_MASK                               0x10
#define _PWM1CON_PWM1OUT_POSN                               0x5
#define _PWM1CON_PWM1OUT_POSITION                           0x5
#define _PWM1CON_PWM1OUT_SIZE                               0x1
#define _PWM1CON_PWM1OUT_LENGTH                             0x1
#define _PWM1CON_PWM1OUT_MASK                               0x20
#define _PWM1CON_PWM1OE_POSN                                0x6
#define _PWM1CON_PWM1OE_POSITION                            0x6
#define _PWM1CON_PWM1OE_SIZE                                0x1
#define _PWM1CON_PWM1OE_LENGTH                              0x1
#define _PWM1CON_PWM1OE_MASK                                0x40
#define _PWM1CON_PWM1EN_POSN                                0x7
#define _PWM1CON_PWM1EN_POSITION                            0x7
#define _PWM1CON_PWM1EN_SIZE                                0x1
#define _PWM1CON_PWM1EN_LENGTH                              0x1
#define _PWM1CON_PWM1EN_MASK                                0x80
#define _PWM1CON_MODE0_POSN                                 0x2
#define _PWM1CON_MODE0_POSITION                             0x2
#define _PWM1CON_MODE0_SIZE                                 0x1
#define _PWM1CON_MODE0_LENGTH                               0x1
#define _PWM1CON_MODE0_MASK                                 0x4
#define _PWM1CON_MODE1_POSN                                 0x3
#define _PWM1CON_MODE1_POSITION                             0x3
#define _PWM1CON_MODE1_SIZE                                 0x1
#define _PWM1CON_MODE1_LENGTH                               0x1
#define _PWM1CON_MODE1_MASK                                 0x8

// Register: PWM1INTE
#define PWM1INTE PWM1INTE
extern volatile unsigned char           PWM1INTE            __at(0xD9C);
#ifndef _LIB_BUILD
asm("PWM1INTE equ 0D9Ch");
#endif
// aliases
extern volatile unsigned char           PWM1INTCON          __at(0xD9C);
#ifndef _LIB_BUILD
asm("PWM1INTCON equ 0D9Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRIE                   :1;
        unsigned DCIE                   :1;
        unsigned PHIE                   :1;
        unsigned OFIE                   :1;
    };
    struct {
        unsigned PWM1PRIE               :1;
        unsigned PWM1DCIE               :1;
        unsigned PWM1PHIE               :1;
        unsigned PWM1OFIE               :1;
    };
} PWM1INTEbits_t;
extern volatile PWM1INTEbits_t PWM1INTEbits __at(0xD9C);
// bitfield macros
#define _PWM1INTE_PRIE_POSN                                 0x0
#define _PWM1INTE_PRIE_POSITION                             0x0
#define _PWM1INTE_PRIE_SIZE                                 0x1
#define _PWM1INTE_PRIE_LENGTH                               0x1
#define _PWM1INTE_PRIE_MASK                                 0x1
#define _PWM1INTE_DCIE_POSN                                 0x1
#define _PWM1INTE_DCIE_POSITION                             0x1
#define _PWM1INTE_DCIE_SIZE                                 0x1
#define _PWM1INTE_DCIE_LENGTH                               0x1
#define _PWM1INTE_DCIE_MASK                                 0x2
#define _PWM1INTE_PHIE_POSN                                 0x2
#define _PWM1INTE_PHIE_POSITION                             0x2
#define _PWM1INTE_PHIE_SIZE                                 0x1
#define _PWM1INTE_PHIE_LENGTH                               0x1
#define _PWM1INTE_PHIE_MASK                                 0x4
#define _PWM1INTE_OFIE_POSN                                 0x3
#define _PWM1INTE_OFIE_POSITION                             0x3
#define _PWM1INTE_OFIE_SIZE                                 0x1
#define _PWM1INTE_OFIE_LENGTH                               0x1
#define _PWM1INTE_OFIE_MASK                                 0x8
#define _PWM1INTE_PWM1PRIE_POSN                             0x0
#define _PWM1INTE_PWM1PRIE_POSITION                         0x0
#define _PWM1INTE_PWM1PRIE_SIZE                             0x1
#define _PWM1INTE_PWM1PRIE_LENGTH                           0x1
#define _PWM1INTE_PWM1PRIE_MASK                             0x1
#define _PWM1INTE_PWM1DCIE_POSN                             0x1
#define _PWM1INTE_PWM1DCIE_POSITION                         0x1
#define _PWM1INTE_PWM1DCIE_SIZE                             0x1
#define _PWM1INTE_PWM1DCIE_LENGTH                           0x1
#define _PWM1INTE_PWM1DCIE_MASK                             0x2
#define _PWM1INTE_PWM1PHIE_POSN                             0x2
#define _PWM1INTE_PWM1PHIE_POSITION                         0x2
#define _PWM1INTE_PWM1PHIE_SIZE                             0x1
#define _PWM1INTE_PWM1PHIE_LENGTH                           0x1
#define _PWM1INTE_PWM1PHIE_MASK                             0x4
#define _PWM1INTE_PWM1OFIE_POSN                             0x3
#define _PWM1INTE_PWM1OFIE_POSITION                         0x3
#define _PWM1INTE_PWM1OFIE_SIZE                             0x1
#define _PWM1INTE_PWM1OFIE_LENGTH                           0x1
#define _PWM1INTE_PWM1OFIE_MASK                             0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned PRIE                   :1;
        unsigned DCIE                   :1;
        unsigned PHIE                   :1;
        unsigned OFIE                   :1;
    };
    struct {
        unsigned PWM1PRIE               :1;
        unsigned PWM1DCIE               :1;
        unsigned PWM1PHIE               :1;
        unsigned PWM1OFIE               :1;
    };
} PWM1INTCONbits_t;
extern volatile PWM1INTCONbits_t PWM1INTCONbits __at(0xD9C);
// bitfield macros
#define _PWM1INTCON_PRIE_POSN                               0x0
#define _PWM1INTCON_PRIE_POSITION                           0x0
#define _PWM1INTCON_PRIE_SIZE                               0x1
#define _PWM1INTCON_PRIE_LENGTH                             0x1
#define _PWM1INTCON_PRIE_MASK                               0x1
#define _PWM1INTCON_DCIE_POSN                               0x1
#define _PWM1INTCON_DCIE_POSITION                           0x1
#define _PWM1INTCON_DCIE_SIZE                               0x1
#define _PWM1INTCON_DCIE_LENGTH                             0x1
#define _PWM1INTCON_DCIE_MASK                               0x2
#define _PWM1INTCON_PHIE_POSN                               0x2
#define _PWM1INTCON_PHIE_POSITION                           0x2
#define _PWM1INTCON_PHIE_SIZE                               0x1
#define _PWM1INTCON_PHIE_LENGTH                             0x1
#define _PWM1INTCON_PHIE_MASK                               0x4
#define _PWM1INTCON_OFIE_POSN                               0x3
#define _PWM1INTCON_OFIE_POSITION                           0x3
#define _PWM1INTCON_OFIE_SIZE                               0x1
#define _PWM1INTCON_OFIE_LENGTH                             0x1
#define _PWM1INTCON_OFIE_MASK                               0x8
#define _PWM1INTCON_PWM1PRIE_POSN                           0x0
#define _PWM1INTCON_PWM1PRIE_POSITION                       0x0
#define _PWM1INTCON_PWM1PRIE_SIZE                           0x1
#define _PWM1INTCON_PWM1PRIE_LENGTH                         0x1
#define _PWM1INTCON_PWM1PRIE_MASK                           0x1
#define _PWM1INTCON_PWM1DCIE_POSN                           0x1
#define _PWM1INTCON_PWM1DCIE_POSITION                       0x1
#define _PWM1INTCON_PWM1DCIE_SIZE                           0x1
#define _PWM1INTCON_PWM1DCIE_LENGTH                         0x1
#define _PWM1INTCON_PWM1DCIE_MASK                           0x2
#define _PWM1INTCON_PWM1PHIE_POSN                           0x2
#define _PWM1INTCON_PWM1PHIE_POSITION                       0x2
#define _PWM1INTCON_PWM1PHIE_SIZE                           0x1
#define _PWM1INTCON_PWM1PHIE_LENGTH                         0x1
#define _PWM1INTCON_PWM1PHIE_MASK                           0x4
#define _PWM1INTCON_PWM1OFIE_POSN                           0x3
#define _PWM1INTCON_PWM1OFIE_POSITION                       0x3
#define _PWM1INTCON_PWM1OFIE_SIZE                           0x1
#define _PWM1INTCON_PWM1OFIE_LENGTH                         0x1
#define _PWM1INTCON_PWM1OFIE_MASK                           0x8

// Register: PWM1INTF
#define PWM1INTF PWM1INTF
extern volatile unsigned char           PWM1INTF            __at(0xD9D);
#ifndef _LIB_BUILD
asm("PWM1INTF equ 0D9Dh");
#endif
// aliases
extern volatile unsigned char           PWM1INTFLG          __at(0xD9D);
#ifndef _LIB_BUILD
asm("PWM1INTFLG equ 0D9Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRIF                   :1;
        unsigned DCIF                   :1;
        unsigned PHIF                   :1;
        unsigned OFIF                   :1;
    };
    struct {
        unsigned PWM1PRIF               :1;
        unsigned PWM1DCIF               :1;
        unsigned PWM1PHIF               :1;
        unsigned PWM1OFIF               :1;
    };
} PWM1INTFbits_t;
