MikroElektronika/core_packages/PIC/XC8/def/PIC16F1574/mcu.h
// Register: PWM3DCL
#define PWM3DCL PWM3DCL
extern volatile unsigned char           PWM3DCL             __at(0xDB3);
#ifndef _LIB_BUILD
asm("PWM3DCL equ 0DB3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DC                     :8;
    };
    struct {
        unsigned PWM3DCL0               :1;
        unsigned PWM3DCL1               :1;
        unsigned PWM3DCL2               :1;
        unsigned PWM3DCL3               :1;
        unsigned PWM3DCL4               :1;
        unsigned PWM3DCL5               :1;
        unsigned PWM3DCL6               :1;
        unsigned PWM3DCL7               :1;
    };
    struct {
        unsigned PWM3DCL                :8;
    };
} PWM3DCLbits_t;
extern volatile PWM3DCLbits_t PWM3DCLbits __at(0xDB3);
// bitfield macros
#define _PWM3DCL_DC_POSN                                    0x0
#define _PWM3DCL_DC_POSITION                                0x0
#define _PWM3DCL_DC_SIZE                                    0x8
#define _PWM3DCL_DC_LENGTH                                  0x8
#define _PWM3DCL_DC_MASK                                    0xFF
#define _PWM3DCL_PWM3DCL0_POSN                              0x0
#define _PWM3DCL_PWM3DCL0_POSITION                          0x0
#define _PWM3DCL_PWM3DCL0_SIZE                              0x1
#define _PWM3DCL_PWM3DCL0_LENGTH                            0x1
#define _PWM3DCL_PWM3DCL0_MASK                              0x1
#define _PWM3DCL_PWM3DCL1_POSN                              0x1
#define _PWM3DCL_PWM3DCL1_POSITION                          0x1
#define _PWM3DCL_PWM3DCL1_SIZE                              0x1
#define _PWM3DCL_PWM3DCL1_LENGTH                            0x1
#define _PWM3DCL_PWM3DCL1_MASK                              0x2
#define _PWM3DCL_PWM3DCL2_POSN                              0x2
#define _PWM3DCL_PWM3DCL2_POSITION                          0x2
#define _PWM3DCL_PWM3DCL2_SIZE                              0x1
#define _PWM3DCL_PWM3DCL2_LENGTH                            0x1
#define _PWM3DCL_PWM3DCL2_MASK                              0x4
#define _PWM3DCL_PWM3DCL3_POSN                              0x3
#define _PWM3DCL_PWM3DCL3_POSITION                          0x3
#define _PWM3DCL_PWM3DCL3_SIZE                              0x1
#define _PWM3DCL_PWM3DCL3_LENGTH                            0x1
#define _PWM3DCL_PWM3DCL3_MASK                              0x8
#define _PWM3DCL_PWM3DCL4_POSN                              0x4
#define _PWM3DCL_PWM3DCL4_POSITION                          0x4
#define _PWM3DCL_PWM3DCL4_SIZE                              0x1
#define _PWM3DCL_PWM3DCL4_LENGTH                            0x1
#define _PWM3DCL_PWM3DCL4_MASK                              0x10
#define _PWM3DCL_PWM3DCL5_POSN                              0x5
#define _PWM3DCL_PWM3DCL5_POSITION                          0x5
#define _PWM3DCL_PWM3DCL5_SIZE                              0x1
#define _PWM3DCL_PWM3DCL5_LENGTH                            0x1
#define _PWM3DCL_PWM3DCL5_MASK                              0x20
#define _PWM3DCL_PWM3DCL6_POSN                              0x6
#define _PWM3DCL_PWM3DCL6_POSITION                          0x6
#define _PWM3DCL_PWM3DCL6_SIZE                              0x1
#define _PWM3DCL_PWM3DCL6_LENGTH                            0x1
#define _PWM3DCL_PWM3DCL6_MASK                              0x40
#define _PWM3DCL_PWM3DCL7_POSN                              0x7
#define _PWM3DCL_PWM3DCL7_POSITION                          0x7
#define _PWM3DCL_PWM3DCL7_SIZE                              0x1
#define _PWM3DCL_PWM3DCL7_LENGTH                            0x1
#define _PWM3DCL_PWM3DCL7_MASK                              0x80
#define _PWM3DCL_PWM3DCL_POSN                               0x0
#define _PWM3DCL_PWM3DCL_POSITION                           0x0
#define _PWM3DCL_PWM3DCL_SIZE                               0x8
#define _PWM3DCL_PWM3DCL_LENGTH                             0x8
#define _PWM3DCL_PWM3DCL_MASK                               0xFF

// Register: PWM3DCH
#define PWM3DCH PWM3DCH
extern volatile unsigned char           PWM3DCH             __at(0xDB4);
#ifndef _LIB_BUILD
asm("PWM3DCH equ 0DB4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DC                     :8;
    };
    struct {
        unsigned PWM3DCH0               :1;
        unsigned PWM3DCH1               :1;
        unsigned PWM3DCH2               :1;
        unsigned PWM3DCH3               :1;
        unsigned PWM3DCH4               :1;
        unsigned PWM3DCH5               :1;
        unsigned PWM3DCH6               :1;
        unsigned PWM3DCH7               :1;
    };
    struct {
        unsigned PWM3DCH                :8;
    };
} PWM3DCHbits_t;
extern volatile PWM3DCHbits_t PWM3DCHbits __at(0xDB4);
// bitfield macros
#define _PWM3DCH_DC_POSN                                    0x0
#define _PWM3DCH_DC_POSITION                                0x0
#define _PWM3DCH_DC_SIZE                                    0x8
#define _PWM3DCH_DC_LENGTH                                  0x8
#define _PWM3DCH_DC_MASK                                    0xFF
#define _PWM3DCH_PWM3DCH0_POSN                              0x0
#define _PWM3DCH_PWM3DCH0_POSITION                          0x0
#define _PWM3DCH_PWM3DCH0_SIZE                              0x1
#define _PWM3DCH_PWM3DCH0_LENGTH                            0x1
#define _PWM3DCH_PWM3DCH0_MASK                              0x1
#define _PWM3DCH_PWM3DCH1_POSN                              0x1
#define _PWM3DCH_PWM3DCH1_POSITION                          0x1
#define _PWM3DCH_PWM3DCH1_SIZE                              0x1
#define _PWM3DCH_PWM3DCH1_LENGTH                            0x1
#define _PWM3DCH_PWM3DCH1_MASK                              0x2
#define _PWM3DCH_PWM3DCH2_POSN                              0x2
#define _PWM3DCH_PWM3DCH2_POSITION                          0x2
#define _PWM3DCH_PWM3DCH2_SIZE                              0x1
#define _PWM3DCH_PWM3DCH2_LENGTH                            0x1
#define _PWM3DCH_PWM3DCH2_MASK                              0x4
#define _PWM3DCH_PWM3DCH3_POSN                              0x3
#define _PWM3DCH_PWM3DCH3_POSITION                          0x3
#define _PWM3DCH_PWM3DCH3_SIZE                              0x1
#define _PWM3DCH_PWM3DCH3_LENGTH                            0x1
#define _PWM3DCH_PWM3DCH3_MASK                              0x8
#define _PWM3DCH_PWM3DCH4_POSN                              0x4
#define _PWM3DCH_PWM3DCH4_POSITION                          0x4
#define _PWM3DCH_PWM3DCH4_SIZE                              0x1
#define _PWM3DCH_PWM3DCH4_LENGTH                            0x1
#define _PWM3DCH_PWM3DCH4_MASK                              0x10
#define _PWM3DCH_PWM3DCH5_POSN                              0x5
#define _PWM3DCH_PWM3DCH5_POSITION                          0x5
#define _PWM3DCH_PWM3DCH5_SIZE                              0x1
#define _PWM3DCH_PWM3DCH5_LENGTH                            0x1
#define _PWM3DCH_PWM3DCH5_MASK                              0x20
#define _PWM3DCH_PWM3DCH6_POSN                              0x6
#define _PWM3DCH_PWM3DCH6_POSITION                          0x6
#define _PWM3DCH_PWM3DCH6_SIZE                              0x1
#define _PWM3DCH_PWM3DCH6_LENGTH                            0x1
#define _PWM3DCH_PWM3DCH6_MASK                              0x40
#define _PWM3DCH_PWM3DCH7_POSN                              0x7
#define _PWM3DCH_PWM3DCH7_POSITION                          0x7
#define _PWM3DCH_PWM3DCH7_SIZE                              0x1
#define _PWM3DCH_PWM3DCH7_LENGTH                            0x1
#define _PWM3DCH_PWM3DCH7_MASK                              0x80
#define _PWM3DCH_PWM3DCH_POSN                               0x0
#define _PWM3DCH_PWM3DCH_POSITION                           0x0
#define _PWM3DCH_PWM3DCH_SIZE                               0x8
#define _PWM3DCH_PWM3DCH_LENGTH                             0x8
#define _PWM3DCH_PWM3DCH_MASK                               0xFF

// Register: PWM3PR
#define PWM3PR PWM3PR
extern volatile unsigned short          PWM3PR              __at(0xDB5);
#ifndef _LIB_BUILD
asm("PWM3PR equ 0DB5h");
#endif

