MikroElektronika/core_packages/PIC/XC8/def/PIC16F1574/mcu.h
extern volatile __bit                   PPSLOCKED           __at(0x7078);	// @ (0xE0F * 8 + 0)
#define                                 PPSLOCKED_bit       _BIT_ACCESS(PPSLOCK,0)
// OPTION_REG<PSA>
extern volatile __bit                   PSA                 __at(0x4AB);	// @ (0x95 * 8 + 3)
#define                                 PSA_bit             _BIT_ACCESS(OPTION_REG,3)
// PWM1CLKCON<PWM1CS0>
extern volatile __bit                   PWM1CS0             __at(0x6CF0);	// @ (0xD9E * 8 + 0)
#define                                 PWM1CS0_bit         _BIT_ACCESS(PWM1CLKCON,0)
// PWM1CLKCON<PWM1CS1>
extern volatile __bit                   PWM1CS1             __at(0x6CF1);	// @ (0xD9E * 8 + 1)
#define                                 PWM1CS1_bit         _BIT_ACCESS(PWM1CLKCON,1)
// PWM1DCH<PWM1DCH0>
extern volatile __bit                   PWM1DCH0            __at(0x6CA0);	// @ (0xD94 * 8 + 0)
#define                                 PWM1DCH0_bit        _BIT_ACCESS(PWM1DCH,0)
// PWM1DCH<PWM1DCH1>
extern volatile __bit                   PWM1DCH1            __at(0x6CA1);	// @ (0xD94 * 8 + 1)
#define                                 PWM1DCH1_bit        _BIT_ACCESS(PWM1DCH,1)
// PWM1DCH<PWM1DCH2>
extern volatile __bit                   PWM1DCH2            __at(0x6CA2);	// @ (0xD94 * 8 + 2)
#define                                 PWM1DCH2_bit        _BIT_ACCESS(PWM1DCH,2)
// PWM1DCH<PWM1DCH3>
extern volatile __bit                   PWM1DCH3            __at(0x6CA3);	// @ (0xD94 * 8 + 3)
#define                                 PWM1DCH3_bit        _BIT_ACCESS(PWM1DCH,3)
// PWM1DCH<PWM1DCH4>
extern volatile __bit                   PWM1DCH4            __at(0x6CA4);	// @ (0xD94 * 8 + 4)
#define                                 PWM1DCH4_bit        _BIT_ACCESS(PWM1DCH,4)
// PWM1DCH<PWM1DCH5>
extern volatile __bit                   PWM1DCH5            __at(0x6CA5);	// @ (0xD94 * 8 + 5)
#define                                 PWM1DCH5_bit        _BIT_ACCESS(PWM1DCH,5)
// PWM1DCH<PWM1DCH6>
extern volatile __bit                   PWM1DCH6            __at(0x6CA6);	// @ (0xD94 * 8 + 6)
#define                                 PWM1DCH6_bit        _BIT_ACCESS(PWM1DCH,6)
// PWM1DCH<PWM1DCH7>
extern volatile __bit                   PWM1DCH7            __at(0x6CA7);	// @ (0xD94 * 8 + 7)
#define                                 PWM1DCH7_bit        _BIT_ACCESS(PWM1DCH,7)
// PWM1INTE<PWM1DCIE>
extern volatile __bit                   PWM1DCIE            __at(0x6CE1);	// @ (0xD9C * 8 + 1)
#define                                 PWM1DCIE_bit        _BIT_ACCESS(PWM1INTE,1)
// PWM1INTF<PWM1DCIF>
extern volatile __bit                   PWM1DCIF            __at(0x6CE9);	// @ (0xD9D * 8 + 1)
#define                                 PWM1DCIF_bit        _BIT_ACCESS(PWM1INTF,1)
// PWM1DCL<PWM1DCL0>
extern volatile __bit                   PWM1DCL0            __at(0x6C98);	// @ (0xD93 * 8 + 0)
#define                                 PWM1DCL0_bit        _BIT_ACCESS(PWM1DCL,0)
// PWM1DCL<PWM1DCL1>
extern volatile __bit                   PWM1DCL1            __at(0x6C99);	// @ (0xD93 * 8 + 1)
#define                                 PWM1DCL1_bit        _BIT_ACCESS(PWM1DCL,1)
// PWM1DCL<PWM1DCL2>
extern volatile __bit                   PWM1DCL2            __at(0x6C9A);	// @ (0xD93 * 8 + 2)
#define                                 PWM1DCL2_bit        _BIT_ACCESS(PWM1DCL,2)
// PWM1DCL<PWM1DCL3>
extern volatile __bit                   PWM1DCL3            __at(0x6C9B);	// @ (0xD93 * 8 + 3)
#define                                 PWM1DCL3_bit        _BIT_ACCESS(PWM1DCL,3)
// PWM1DCL<PWM1DCL4>
extern volatile __bit                   PWM1DCL4            __at(0x6C9C);	// @ (0xD93 * 8 + 4)
#define                                 PWM1DCL4_bit        _BIT_ACCESS(PWM1DCL,4)
// PWM1DCL<PWM1DCL5>
extern volatile __bit                   PWM1DCL5            __at(0x6C9D);	// @ (0xD93 * 8 + 5)
#define                                 PWM1DCL5_bit        _BIT_ACCESS(PWM1DCL,5)
// PWM1DCL<PWM1DCL6>
extern volatile __bit                   PWM1DCL6            __at(0x6C9E);	// @ (0xD93 * 8 + 6)
#define                                 PWM1DCL6_bit        _BIT_ACCESS(PWM1DCL,6)
// PWM1DCL<PWM1DCL7>
extern volatile __bit                   PWM1DCL7            __at(0x6C9F);	// @ (0xD93 * 8 + 7)
#define                                 PWM1DCL7_bit        _BIT_ACCESS(PWM1DCL,7)
// PWM1CON<PWM1EN>
extern volatile __bit                   PWM1EN              __at(0x6CDF);	// @ (0xD9B * 8 + 7)
#define                                 PWM1EN_bit          _BIT_ACCESS(PWM1CON,7)
// PWMEN<PWM1EN_A>
extern volatile __bit                   PWM1EN_A            __at(0x6C70);	// @ (0xD8E * 8 + 0)
#define                                 PWM1EN_A_bit        _BIT_ACCESS(PWMEN,0)
// PIE3<PWM1IE>
extern volatile __bit                   PWM1IE              __at(0x49C);	// @ (0x93 * 8 + 4)
#define                                 PWM1IE_bit          _BIT_ACCESS(PIE3,4)
// PIR3<PWM1IF>
extern volatile __bit                   PWM1IF              __at(0x9C);	// @ (0x13 * 8 + 4)
#define                                 PWM1IF_bit          _BIT_ACCESS(PIR3,4)
// PWM1LDCON<PWM1LD>
extern volatile __bit                   PWM1LD              __at(0x6CFF);	// @ (0xD9F * 8 + 7)
#define                                 PWM1LD_bit          _BIT_ACCESS(PWM1LDCON,7)
// PWMLD<PWM1LDA_A>
extern volatile __bit                   PWM1LDA_A           __at(0x6C78);	// @ (0xD8F * 8 + 0)
#define                                 PWM1LDA_A_bit       _BIT_ACCESS(PWMLD,0)
// PWM1LDCON<PWM1LDM>
extern volatile __bit                   PWM1LDM             __at(0x6CFE);	// @ (0xD9F * 8 + 6)
#define                                 PWM1LDM_bit         _BIT_ACCESS(PWM1LDCON,6)
// PWM1LDCON<PWM1LDS0>
extern volatile __bit                   PWM1LDS0            __at(0x6CF8);	// @ (0xD9F * 8 + 0)
#define                                 PWM1LDS0_bit        _BIT_ACCESS(PWM1LDCON,0)
// PWM1LDCON<PWM1LDS1>
extern volatile __bit                   PWM1LDS1            __at(0x6CF9);	// @ (0xD9F * 8 + 1)
#define                                 PWM1LDS1_bit        _BIT_ACCESS(PWM1LDCON,1)
// PWM1CON<PWM1MODE0>
extern volatile __bit                   PWM1MODE0           __at(0x6CDA);	// @ (0xD9B * 8 + 2)
#define                                 PWM1MODE0_bit       _BIT_ACCESS(PWM1CON,2)
// PWM1CON<PWM1MODE1>
extern volatile __bit                   PWM1MODE1           __at(0x6CDB);	// @ (0xD9B * 8 + 3)
#define                                 PWM1MODE1_bit       _BIT_ACCESS(PWM1CON,3)
// PWM1CON<PWM1OE>
extern volatile __bit                   PWM1OE              __at(0x6CDE);	// @ (0xD9B * 8 + 6)
#define                                 PWM1OE_bit          _BIT_ACCESS(PWM1CON,6)
// PWM1OFH<PWM1OFH0>
extern volatile __bit                   PWM1OFH0            __at(0x6CC0);	// @ (0xD98 * 8 + 0)
#define                                 PWM1OFH0_bit        _BIT_ACCESS(PWM1OFH,0)
// PWM1OFH<PWM1OFH1>
extern volatile __bit                   PWM1OFH1            __at(0x6CC1);	// @ (0xD98 * 8 + 1)
#define                                 PWM1OFH1_bit        _BIT_ACCESS(PWM1OFH,1)
// PWM1OFH<PWM1OFH2>
extern volatile __bit                   PWM1OFH2            __at(0x6CC2);	// @ (0xD98 * 8 + 2)
#define                                 PWM1OFH2_bit        _BIT_ACCESS(PWM1OFH,2)
// PWM1OFH<PWM1OFH3>
extern volatile __bit                   PWM1OFH3            __at(0x6CC3);	// @ (0xD98 * 8 + 3)
#define                                 PWM1OFH3_bit        _BIT_ACCESS(PWM1OFH,3)
// PWM1OFH<PWM1OFH4>
extern volatile __bit                   PWM1OFH4            __at(0x6CC4);	// @ (0xD98 * 8 + 4)
#define                                 PWM1OFH4_bit        _BIT_ACCESS(PWM1OFH,4)
// PWM1OFH<PWM1OFH5>
extern volatile __bit                   PWM1OFH5            __at(0x6CC5);	// @ (0xD98 * 8 + 5)
#define                                 PWM1OFH5_bit        _BIT_ACCESS(PWM1OFH,5)
// PWM1OFH<PWM1OFH6>
extern volatile __bit                   PWM1OFH6            __at(0x6CC6);	// @ (0xD98 * 8 + 6)
#define                                 PWM1OFH6_bit        _BIT_ACCESS(PWM1OFH,6)
// PWM1OFH<PWM1OFH7>
extern volatile __bit                   PWM1OFH7            __at(0x6CC7);	// @ (0xD98 * 8 + 7)
#define                                 PWM1OFH7_bit        _BIT_ACCESS(PWM1OFH,7)
// PWM1INTE<PWM1OFIE>
extern volatile __bit                   PWM1OFIE            __at(0x6CE3);	// @ (0xD9C * 8 + 3)
#define                                 PWM1OFIE_bit        _BIT_ACCESS(PWM1INTE,3)
// PWM1INTF<PWM1OFIF>
extern volatile __bit                   PWM1OFIF            __at(0x6CEB);	// @ (0xD9D * 8 + 3)
#define                                 PWM1OFIF_bit        _BIT_ACCESS(PWM1INTF,3)
// PWM1OFL<PWM1OFL0>
extern volatile __bit                   PWM1OFL0            __at(0x6CB8);	// @ (0xD97 * 8 + 0)
#define                                 PWM1OFL0_bit        _BIT_ACCESS(PWM1OFL,0)
// PWM1OFL<PWM1OFL1>
extern volatile __bit                   PWM1OFL1            __at(0x6CB9);	// @ (0xD97 * 8 + 1)
#define                                 PWM1OFL1_bit        _BIT_ACCESS(PWM1OFL,1)
// PWM1OFL<PWM1OFL2>
extern volatile __bit                   PWM1OFL2            __at(0x6CBA);	// @ (0xD97 * 8 + 2)
#define                                 PWM1OFL2_bit        _BIT_ACCESS(PWM1OFL,2)
// PWM1OFL<PWM1OFL3>
extern volatile __bit                   PWM1OFL3            __at(0x6CBB);	// @ (0xD97 * 8 + 3)
#define                                 PWM1OFL3_bit        _BIT_ACCESS(PWM1OFL,3)
// PWM1OFL<PWM1OFL4>
extern volatile __bit                   PWM1OFL4            __at(0x6CBC);	// @ (0xD97 * 8 + 4)
#define                                 PWM1OFL4_bit        _BIT_ACCESS(PWM1OFL,4)
// PWM1OFL<PWM1OFL5>
extern volatile __bit                   PWM1OFL5            __at(0x6CBD);	// @ (0xD97 * 8 + 5)
#define                                 PWM1OFL5_bit        _BIT_ACCESS(PWM1OFL,5)
// PWM1OFL<PWM1OFL6>
extern volatile __bit                   PWM1OFL6            __at(0x6CBE);	// @ (0xD97 * 8 + 6)
#define                                 PWM1OFL6_bit        _BIT_ACCESS(PWM1OFL,6)
// PWM1OFL<PWM1OFL7>
extern volatile __bit                   PWM1OFL7            __at(0x6CBF);	// @ (0xD97 * 8 + 7)
#define                                 PWM1OFL7_bit        _BIT_ACCESS(PWM1OFL,7)
// PWM1OFCON<PWM1OFM0>
extern volatile __bit                   PWM1OFM0            __at(0x6D05);	// @ (0xDA0 * 8 + 5)
#define                                 PWM1OFM0_bit        _BIT_ACCESS(PWM1OFCON,5)
// PWM1OFCON<PWM1OFM1>
extern volatile __bit                   PWM1OFM1            __at(0x6D06);	// @ (0xDA0 * 8 + 6)
#define                                 PWM1OFM1_bit        _BIT_ACCESS(PWM1OFCON,6)
// PWM1OFCON<PWM1OFMC>
extern volatile __bit                   PWM1OFMC            __at(0x6D04);	// @ (0xDA0 * 8 + 4)
#define                                 PWM1OFMC_bit        _BIT_ACCESS(PWM1OFCON,4)
// PWM1OFCON<PWM1OFS0>
extern volatile __bit                   PWM1OFS0            __at(0x6D00);	// @ (0xDA0 * 8 + 0)
#define                                 PWM1OFS0_bit        _BIT_ACCESS(PWM1OFCON,0)
// PWM1OFCON<PWM1OFS1>
extern volatile __bit                   PWM1OFS1            __at(0x6D01);	// @ (0xDA0 * 8 + 1)
#define                                 PWM1OFS1_bit        _BIT_ACCESS(PWM1OFCON,1)
// PWM1CON<PWM1OUT>
extern volatile __bit                   PWM1OUT             __at(0x6CDD);	// @ (0xD9B * 8 + 5)
#define                                 PWM1OUT_bit         _BIT_ACCESS(PWM1CON,5)
// PWMOUT<PWM1OUT_A>
extern volatile __bit                   PWM1OUT_A           __at(0x6C80);	// @ (0xD90 * 8 + 0)
#define                                 PWM1OUT_A_bit       _BIT_ACCESS(PWMOUT,0)
// PWM1PHH<PWM1PHH0>
extern volatile __bit                   PWM1PHH0            __at(0x6C90);	// @ (0xD92 * 8 + 0)
#define                                 PWM1PHH0_bit        _BIT_ACCESS(PWM1PHH,0)
// PWM1PHH<PWM1PHH1>
extern volatile __bit                   PWM1PHH1            __at(0x6C91);	// @ (0xD92 * 8 + 1)
#define                                 PWM1PHH1_bit        _BIT_ACCESS(PWM1PHH,1)
// PWM1PHH<PWM1PHH2>
extern volatile __bit                   PWM1PHH2            __at(0x6C92);	// @ (0xD92 * 8 + 2)
#define                                 PWM1PHH2_bit        _BIT_ACCESS(PWM1PHH,2)
// PWM1PHH<PWM1PHH3>
extern volatile __bit                   PWM1PHH3            __at(0x6C93);	// @ (0xD92 * 8 + 3)
#define                                 PWM1PHH3_bit        _BIT_ACCESS(PWM1PHH,3)
// PWM1PHH<PWM1PHH4>
extern volatile __bit                   PWM1PHH4            __at(0x6C94);	// @ (0xD92 * 8 + 4)
#define                                 PWM1PHH4_bit        _BIT_ACCESS(PWM1PHH,4)
// PWM1PHH<PWM1PHH5>
extern volatile __bit                   PWM1PHH5            __at(0x6C95);	// @ (0xD92 * 8 + 5)
#define                                 PWM1PHH5_bit        _BIT_ACCESS(PWM1PHH,5)
// PWM1PHH<PWM1PHH6>
extern volatile __bit                   PWM1PHH6            __at(0x6C96);	// @ (0xD92 * 8 + 6)
#define                                 PWM1PHH6_bit        _BIT_ACCESS(PWM1PHH,6)
// PWM1PHH<PWM1PHH7>
extern volatile __bit                   PWM1PHH7            __at(0x6C97);	// @ (0xD92 * 8 + 7)
#define                                 PWM1PHH7_bit        _BIT_ACCESS(PWM1PHH,7)
// PWM1INTE<PWM1PHIE>
extern volatile __bit                   PWM1PHIE            __at(0x6CE2);	// @ (0xD9C * 8 + 2)
#define                                 PWM1PHIE_bit        _BIT_ACCESS(PWM1INTE,2)
// PWM1INTF<PWM1PHIF>
extern volatile __bit                   PWM1PHIF            __at(0x6CEA);	// @ (0xD9D * 8 + 2)
#define                                 PWM1PHIF_bit        _BIT_ACCESS(PWM1INTF,2)
// PWM1PHL<PWM1PHL0>
extern volatile __bit                   PWM1PHL0            __at(0x6C88);	// @ (0xD91 * 8 + 0)
#define                                 PWM1PHL0_bit        _BIT_ACCESS(PWM1PHL,0)
// PWM1PHL<PWM1PHL1>
extern volatile __bit                   PWM1PHL1            __at(0x6C89);	// @ (0xD91 * 8 + 1)
#define                                 PWM1PHL1_bit        _BIT_ACCESS(PWM1PHL,1)
// PWM1PHL<PWM1PHL2>
extern volatile __bit                   PWM1PHL2            __at(0x6C8A);	// @ (0xD91 * 8 + 2)
#define                                 PWM1PHL2_bit        _BIT_ACCESS(PWM1PHL,2)
// PWM1PHL<PWM1PHL3>
extern volatile __bit                   PWM1PHL3            __at(0x6C8B);	// @ (0xD91 * 8 + 3)
#define                                 PWM1PHL3_bit        _BIT_ACCESS(PWM1PHL,3)
// PWM1PHL<PWM1PHL4>
extern volatile __bit                   PWM1PHL4            __at(0x6C8C);	// @ (0xD91 * 8 + 4)
#define                                 PWM1PHL4_bit        _BIT_ACCESS(PWM1PHL,4)
// PWM1PHL<PWM1PHL5>
extern volatile __bit                   PWM1PHL5            __at(0x6C8D);	// @ (0xD91 * 8 + 5)
#define                                 PWM1PHL5_bit        _BIT_ACCESS(PWM1PHL,5)
// PWM1PHL<PWM1PHL6>
extern volatile __bit                   PWM1PHL6            __at(0x6C8E);	// @ (0xD91 * 8 + 6)
#define                                 PWM1PHL6_bit        _BIT_ACCESS(PWM1PHL,6)
// PWM1PHL<PWM1PHL7>
extern volatile __bit                   PWM1PHL7            __at(0x6C8F);	// @ (0xD91 * 8 + 7)
#define                                 PWM1PHL7_bit        _BIT_ACCESS(PWM1PHL,7)
// PWM1CON<PWM1POL>
extern volatile __bit                   PWM1POL             __at(0x6CDC);	// @ (0xD9B * 8 + 4)
#define                                 PWM1POL_bit         _BIT_ACCESS(PWM1CON,4)
// PWM1PRH<PWM1PRH0>
extern volatile __bit                   PWM1PRH0            __at(0x6CB0);	// @ (0xD96 * 8 + 0)
#define                                 PWM1PRH0_bit        _BIT_ACCESS(PWM1PRH,0)
// PWM1PRH<PWM1PRH1>
extern volatile __bit                   PWM1PRH1            __at(0x6CB1);	// @ (0xD96 * 8 + 1)
#define                                 PWM1PRH1_bit        _BIT_ACCESS(PWM1PRH,1)
// PWM1PRH<PWM1PRH2>
extern volatile __bit                   PWM1PRH2            __at(0x6CB2);	// @ (0xD96 * 8 + 2)
#define                                 PWM1PRH2_bit        _BIT_ACCESS(PWM1PRH,2)
// PWM1PRH<PWM1PRH3>
extern volatile __bit                   PWM1PRH3            __at(0x6CB3);	// @ (0xD96 * 8 + 3)
#define                                 PWM1PRH3_bit        _BIT_ACCESS(PWM1PRH,3)
// PWM1PRH<PWM1PRH4>
extern volatile __bit                   PWM1PRH4            __at(0x6CB4);	// @ (0xD96 * 8 + 4)
#define                                 PWM1PRH4_bit        _BIT_ACCESS(PWM1PRH,4)
// PWM1PRH<PWM1PRH5>
extern volatile __bit                   PWM1PRH5            __at(0x6CB5);	// @ (0xD96 * 8 + 5)
#define                                 PWM1PRH5_bit        _BIT_ACCESS(PWM1PRH,5)
// PWM1PRH<PWM1PRH6>
extern volatile __bit                   PWM1PRH6            __at(0x6CB6);	// @ (0xD96 * 8 + 6)
#define                                 PWM1PRH6_bit        _BIT_ACCESS(PWM1PRH,6)
// PWM1PRH<PWM1PRH7>
extern volatile __bit                   PWM1PRH7            __at(0x6CB7);	// @ (0xD96 * 8 + 7)
#define                                 PWM1PRH7_bit        _BIT_ACCESS(PWM1PRH,7)
// PWM1INTE<PWM1PRIE>
extern volatile __bit                   PWM1PRIE            __at(0x6CE0);	// @ (0xD9C * 8 + 0)
#define                                 PWM1PRIE_bit        _BIT_ACCESS(PWM1INTE,0)
// PWM1INTF<PWM1PRIF>
extern volatile __bit                   PWM1PRIF            __at(0x6CE8);	// @ (0xD9D * 8 + 0)
#define                                 PWM1PRIF_bit        _BIT_ACCESS(PWM1INTF,0)
// PWM1PRL<PWM1PRL0>
extern volatile __bit                   PWM1PRL0            __at(0x6CA8);	// @ (0xD95 * 8 + 0)
#define                                 PWM1PRL0_bit        _BIT_ACCESS(PWM1PRL,0)
// PWM1PRL<PWM1PRL1>
extern volatile __bit                   PWM1PRL1            __at(0x6CA9);	// @ (0xD95 * 8 + 1)
#define                                 PWM1PRL1_bit        _BIT_ACCESS(PWM1PRL,1)
// PWM1PRL<PWM1PRL2>
extern volatile __bit                   PWM1PRL2            __at(0x6CAA);	// @ (0xD95 * 8 + 2)
#define                                 PWM1PRL2_bit        _BIT_ACCESS(PWM1PRL,2)
// PWM1PRL<PWM1PRL3>
extern volatile __bit                   PWM1PRL3            __at(0x6CAB);	// @ (0xD95 * 8 + 3)
#define                                 PWM1PRL3_bit        _BIT_ACCESS(PWM1PRL,3)
// PWM1PRL<PWM1PRL4>
extern volatile __bit                   PWM1PRL4            __at(0x6CAC);	// @ (0xD95 * 8 + 4)
#define                                 PWM1PRL4_bit        _BIT_ACCESS(PWM1PRL,4)
// PWM1PRL<PWM1PRL5>
extern volatile __bit                   PWM1PRL5            __at(0x6CAD);	// @ (0xD95 * 8 + 5)
#define                                 PWM1PRL5_bit        _BIT_ACCESS(PWM1PRL,5)
// PWM1PRL<PWM1PRL6>
extern volatile __bit                   PWM1PRL6            __at(0x6CAE);	// @ (0xD95 * 8 + 6)
#define                                 PWM1PRL6_bit        _BIT_ACCESS(PWM1PRL,6)
// PWM1PRL<PWM1PRL7>
extern volatile __bit                   PWM1PRL7            __at(0x6CAF);	// @ (0xD95 * 8 + 7)
#define                                 PWM1PRL7_bit        _BIT_ACCESS(PWM1PRL,7)
// PWM1CLKCON<PWM1PS0>
extern volatile __bit                   PWM1PS0             __at(0x6CF4);	// @ (0xD9E * 8 + 4)
#define                                 PWM1PS0_bit         _BIT_ACCESS(PWM1CLKCON,4)
// PWM1CLKCON<PWM1PS1>
extern volatile __bit                   PWM1PS1             __at(0x6CF5);	// @ (0xD9E * 8 + 5)
#define                                 PWM1PS1_bit         _BIT_ACCESS(PWM1CLKCON,5)
// PWM1CLKCON<PWM1PS2>
extern volatile __bit                   PWM1PS2             __at(0x6CF6);	// @ (0xD9E * 8 + 6)
#define                                 PWM1PS2_bit         _BIT_ACCESS(PWM1CLKCON,6)
// PWM1TMRH<PWM1TMRH0>
extern volatile __bit                   PWM1TMRH0           __at(0x6CD0);	// @ (0xD9A * 8 + 0)
#define                                 PWM1TMRH0_bit       _BIT_ACCESS(PWM1TMRH,0)
// PWM1TMRH<PWM1TMRH1>
extern volatile __bit                   PWM1TMRH1           __at(0x6CD1);	// @ (0xD9A * 8 + 1)
#define                                 PWM1TMRH1_bit       _BIT_ACCESS(PWM1TMRH,1)
// PWM1TMRH<PWM1TMRH2>
extern volatile __bit                   PWM1TMRH2           __at(0x6CD2);	// @ (0xD9A * 8 + 2)
#define                                 PWM1TMRH2_bit       _BIT_ACCESS(PWM1TMRH,2)
// PWM1TMRH<PWM1TMRH3>
extern volatile __bit                   PWM1TMRH3           __at(0x6CD3);	// @ (0xD9A * 8 + 3)
#define                                 PWM1TMRH3_bit       _BIT_ACCESS(PWM1TMRH,3)
// PWM1TMRH<PWM1TMRH4>
extern volatile __bit                   PWM1TMRH4           __at(0x6CD4);	// @ (0xD9A * 8 + 4)
#define                                 PWM1TMRH4_bit       _BIT_ACCESS(PWM1TMRH,4)
// PWM1TMRH<PWM1TMRH5>
extern volatile __bit                   PWM1TMRH5           __at(0x6CD5);	// @ (0xD9A * 8 + 5)
#define                                 PWM1TMRH5_bit       _BIT_ACCESS(PWM1TMRH,5)
// PWM1TMRH<PWM1TMRH6>
extern volatile __bit                   PWM1TMRH6           __at(0x6CD6);	// @ (0xD9A * 8 + 6)
#define                                 PWM1TMRH6_bit       _BIT_ACCESS(PWM1TMRH,6)
// PWM1TMRH<PWM1TMRH7>
extern volatile __bit                   PWM1TMRH7           __at(0x6CD7);	// @ (0xD9A * 8 + 7)
#define                                 PWM1TMRH7_bit       _BIT_ACCESS(PWM1TMRH,7)
// PWM1TMRL<PWM1TMRL0>
extern volatile __bit                   PWM1TMRL0           __at(0x6CC8);	// @ (0xD99 * 8 + 0)
#define                                 PWM1TMRL0_bit       _BIT_ACCESS(PWM1TMRL,0)
// PWM1TMRL<PWM1TMRL1>
extern volatile __bit                   PWM1TMRL1           __at(0x6CC9);	// @ (0xD99 * 8 + 1)
#define                                 PWM1TMRL1_bit       _BIT_ACCESS(PWM1TMRL,1)
// PWM1TMRL<PWM1TMRL2>
extern volatile __bit                   PWM1TMRL2           __at(0x6CCA);	// @ (0xD99 * 8 + 2)
#define                                 PWM1TMRL2_bit       _BIT_ACCESS(PWM1TMRL,2)
// PWM1TMRL<PWM1TMRL3>
extern volatile __bit                   PWM1TMRL3           __at(0x6CCB);	// @ (0xD99 * 8 + 3)
#define                                 PWM1TMRL3_bit       _BIT_ACCESS(PWM1TMRL,3)
// PWM1TMRL<PWM1TMRL4>
extern volatile __bit                   PWM1TMRL4           __at(0x6CCC);	// @ (0xD99 * 8 + 4)
#define                                 PWM1TMRL4_bit       _BIT_ACCESS(PWM1TMRL,4)
// PWM1TMRL<PWM1TMRL5>
extern volatile __bit                   PWM1TMRL5           __at(0x6CCD);	// @ (0xD99 * 8 + 5)
#define                                 PWM1TMRL5_bit       _BIT_ACCESS(PWM1TMRL,5)
// PWM1TMRL<PWM1TMRL6>
extern volatile __bit                   PWM1TMRL6           __at(0x6CCE);	// @ (0xD99 * 8 + 6)
#define                                 PWM1TMRL6_bit       _BIT_ACCESS(PWM1TMRL,6)
// PWM1TMRL<PWM1TMRL7>
extern volatile __bit                   PWM1TMRL7           __at(0x6CCF);	// @ (0xD99 * 8 + 7)
#define                                 PWM1TMRL7_bit       _BIT_ACCESS(PWM1TMRL,7)
// PWM2CLKCON<PWM2CS0>
extern volatile __bit                   PWM2CS0             __at(0x6D70);	// @ (0xDAE * 8 + 0)
#define                                 PWM2CS0_bit         _BIT_ACCESS(PWM2CLKCON,0)
// PWM2CLKCON<PWM2CS1>
extern volatile __bit                   PWM2CS1             __at(0x6D71);	// @ (0xDAE * 8 + 1)
#define                                 PWM2CS1_bit         _BIT_ACCESS(PWM2CLKCON,1)
// PWM2DCH<PWM2DCH0>
extern volatile __bit                   PWM2DCH0            __at(0x6D20);	// @ (0xDA4 * 8 + 0)
#define                                 PWM2DCH0_bit        _BIT_ACCESS(PWM2DCH,0)
// PWM2DCH<PWM2DCH1>
extern volatile __bit                   PWM2DCH1            __at(0x6D21);	// @ (0xDA4 * 8 + 1)
#define                                 PWM2DCH1_bit        _BIT_ACCESS(PWM2DCH,1)
// PWM2DCH<PWM2DCH2>
extern volatile __bit                   PWM2DCH2            __at(0x6D22);	// @ (0xDA4 * 8 + 2)
#define                                 PWM2DCH2_bit        _BIT_ACCESS(PWM2DCH,2)
// PWM2DCH<PWM2DCH3>
